using System;

/*
 * Павел Корженко
 */

/*
 * 1. Написать метод, возвращающий минимальное из трех чисел.
 * 2. Написать метод подсчета количества цифр числа.
 * 3. С клавиатуры вводятся числа, пока не будет введен 0. Подсчитать сумму всех нечетных положительных чисел.
 * 4. Реализовать метод проверки логина и пароля. На вход подается логин и пароль. На выходе истина, если прошел 
 *    авторизацию, и ложь, если не прошел (Логин: root, Password: GeekBrains). Используя метод проверки логина и 
 *    пароля, написать программу: пользователь вводит логин и пароль, программа пропускает его дальше или не пропускает.
 *    С помощью цикла do while ограничить ввод пароля тремя попытками.
 * 5. а) Написать программу, которая запрашивает массу и рост человека, вычисляет его индекс массы и сообщает, 
 *       нужно ли человеку похудеть, набрать вес или все в норме;
 *    б) *Рассчитать, на сколько кг похудеть или сколько кг набрать для нормализации веса.
 * 6. *Написать программу подсчета количества «Хороших» чисел в диапазоне от 1 до 1 000 000 000. Хорошим называется 
 *    число, которое делится на сумму своих цифр. Реализовать подсчет времени выполнения программы, используя 
 *    структуру DateTime.
 * 7. a) Разработать рекурсивный метод, который выводит на экран числа от a до b (a<b);
 *    б) *Разработать рекурсивный метод, который считает сумму чисел от a до b.
 * 
 * Достаточно решить 4 задачи. Разбивайте программы на подпрограммы. Переписывайте в начало программы условие 
 * и свою фамилию. Все программы делайте в одном решении.
 */

namespace lession02
{
    class Program
    {
        static void Main(string[] args)
        {
            Console.WriteLine("Hello World!");
        }
    }
}
